app/controllers/admin/post_resources_controller.rb

SELECT * FROM "post_resources" WHERE ("post_resources"."id" = 0 AND ("post_resources".post_id = 1)) ORDER BY position asc
SELECT * FROM "posts" WHERE ("posts"."id" = 0) LIMIT 1
---
 def up
  @post.post_resources.find(params[:id]).move_higher