app/controllers/admin/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 3) LIMIT 1
---
  def show
    @post = Post.find(params[:id])

INSERT INTO `posts` (`updated_at`, `title`, `body`, `comment_count`, `teaser`, `created_at`) VALUES('2009-05-13 04:55:15', 'Video ecoding with Rails and Sesame Vault\'s ruby API', '', NULL, 'Sesame Vault provides video storage and streaming. It will also encode videos that are uploaded, and offers a ruby API. They provide some example code but I had to make a few changes. I also prefer jQuery jto prototype, so the JavaScript has been rewritten.', '2009-05-13 04:55:15')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE `posts` SET `body` = 'Sesame Vault provides video storage and streaming. It will also encode videos that are uploaded, and offers a ruby API. They provide some example code but I had to make a few changes. I also prefer jQuery jto prototype, so the JavaScript has been rewritten.', `updated_at` = '2009-05-13 04:56:37' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])