app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`name`, `commentable_type`, `updated_at`, `body`, `lft`, `post_id`, `url`, `commentable_id`, `rgt`, `parent_id`, `spam`, `email`, `created_at`) VALUES('Dinshaw', 'Post', '2009-05-13 16:38:27', 'test comment', 1, NULL, '', 3, 2, NULL, NULL, 'info@dinshaw.us', '2009-05-13 16:38:27')