app/controllers/posts_controller.rb

  def index
    params[:post_search] ||= {}

    @post_search = PostSearch.new(params[:post_search])

    @posts = Post.search(
      @post_search.keywords,
      :conditions => @post_search.conditions,
      :order => :created_at,
      :sort_mode => :desc,
      :page => params[:page] || 1,
      :per_page => params[:per_page] || 6
    )
---
SELECT * FROM `posts`
SELECT count(*) AS count_all FROM `posts`